/****************************************Copyright (c)**************************************************
**                                       清  风  海  岸
**
**                                       yzfcer@163.com
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: db.c
**创   建   人: Jason Zhou
**最后修改日期: 2017.12.19
**描        述: 
**              
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: 
** 版  本: v1.0
** 日　期: 2017.12.19
** 描　述: 原始版本
**
**--------------当前版本修订----------------------------------------------------------------------------
** 修改人: 
** 日　期: 2017.12.19
** 描　述: 
**
**------------------------------------------------------------------------------------------------------
*******************************************************************************************************/
#ifndef DB_H__
#define DB_H__
#include "wind_type.h"
#define DB_BLK_SIZE 512
#define DB_NAME_LEN 12  //数据库名字长度
#define TB_NAME_LEN 12  //数据表名字长度
#define MBR_NAME_LEN 20  //数据名字长度


typedef struct
{
    w_uint16_t msgid;
    char dbname[DB_NAME_LEN];
    w_int32_t dbsize;
}db_msg_s;

#define db_get_addr(base,offset) (w_addr_t)((offset)+(w_addr_t)(base))
#define db_get_offset(base,addr) (w_uint32_t)((w_addr_t)(addr)+(w_addr_t)(base))
#endif
